Repository: AntonTokola/AvaTraceAPN-Editor
Catalog: AvaTrace APN Editor/Strings.*.resx
Languages: fi

# addAddressManually
source: Enter the address manually:
fi: Syötä osoite manuaalisesti:

# APNAddressInfoText_text
source: Enter the new APN address manually, or select a ready-made address of a specific operator from the drop-down box.
fi: Syötä uusi APN-osoite manuaalisesti, tai valitse alasvetolaatikosta valmis tietyn operaattorin osoite.

# apnOsoitettaEiOleMääritetty
source: There is currently no separate APN address assigned to the unit. (this selection is suitable for e.g. Elisa and DNA subscriptions).
fi: Mittarille ei ole määritetty tällä hetkellä erillistä APN-osoitetta. (tämä valinta sopii mm. Elisan ja DNA:n liittymille).

# applyApnAddressButton_text
source: Apply the APN-address
fi: Syötä osoite laitteelle

# currentApnAddress_APNosoiteVaihdettu_1
source: The APN address was changed successfully! New APN address:
fi: APN-osoitteen vaihto onnistui! Mittarin uusi APN-osoite:

# currentApnAddress_APNosoiteVaihdettu_2
source: Now you can close the application.
fi: Nyt voit sulkea sovelluksen.

# currentApnAddress_APNosoitteenVaihtoOnnistuiEiApnOsoitettaMääritelty
source: The APN address change was successful! New APN address: an empty APN address has been defined for the meter. (this selection is suitable for e.g. Elisa and DNA subscriptions). Now you can close the application.
fi: APN-osoitteen vaihto onnistui! Mittarin uusi APN-osoite: mittarille on määritelty tyhjä APN-osoite. (tämä valinta sopii mm. Elisan ja DNA:n liittymille). Nyt voit sulkea sovelluksen.

# currentApnAddress_nykyinenOsoite
source: Current APN address:
fi: Mittarin nykyinen APN-osoite:

# messageBox_HaluatkoSulkeaSovelluksen
source: Are you sure you want to close the app?
fi: Haluatko varmasti sulkea sovelluksen?

# pickUpAddressFromList
source: Select an APN-address:
fi: Valitse osoite listasta:

# quitButton_text
source: Quit
fi: Lopeta

# scanAvaTraceUnitButton_text
source: Start the scanning
fi: Suorita laitteen luku

# statusText_apnOsoitettaEiLöytynyt
source: APN address not found. An address may not have been defined.
fi: APN-osoitetta ei löytynyt. Mittarille ei ole mahdollisesti määritelty osoitetta.

# statusText_APNosoitettaEiLöytynytSuljeSovellus
source: APN address not found. The unit may not have an address defined. Close the application.
fi: APN-osoitetta ei löytynyt. Mittarille ei ole mahdollisesti määritelty osoitetta. Sulje sovellus.

# statusText_nmapAsennustaEiLöydy
source: Nmap installation directory not found. Unable to configure APN address. Close the program and install Nmap first.
fi: Nmap-sovelluksen asennushakemistoa ei löydy. APN-osoitteen määritystä ei voida tehdä. Sulje ohjelma, ja asenna Nmap ensin.

# statusText_nmapSovellusLöytyi_1
source: The Nmap application was found on your computer in the following directory:
fi: Nmap-sovellus löytyi tietokoneeltasi seuraavasta hakemistosta:

# statusText_nmapSovellusLöytyi_2
source: Next, press and hold Ava's 'Connect' button for at least 5 seconds. When the first connection light starts flashing, start the scanning.
fi: Seuraavaksi paina Avan 'Connect'-nappia vähintään 5-sekuntia pohjassa. Kun ensimmäinen yhteysvalo alkaa vilkkua, suorita laitteen luku.

# statusText_nmapSovellustaEtsitään
source: Searching for nmap application..
fi: Nmap sovellusta etsitään..

# statusText_osoitettaAPNosoitettaVaihdetaan
source: Please wait, the APN address is being changed.. Do not disconnect the cable until the operation is completed.
fi: Odota ole hyvä, APN-osoitetta vaihdetaan.. Älä irrota kaapelia ennen kuin toiminto on suoritettu loppuun.

# statusText_yhteysMuodostettuOnnistuneesti
source: Connection established successfully
fi: Yhteys muodostettu onnistuneesti

# statusText_yhteyttäMuodostetaan
source: Connecting, this may take a while..
fi: Yhteyttä muodostetaan, tässä saattaa kestää hetki..
